html/scheme/tutorial/string.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>字符串</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="assign.html"> UP </a>
 |
 <a accesskey="H" href="slt.html"> HOME </a>
</div><div id="content">
<h1 class="title">字符串</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdad31ce">字符</a></li>
<li><a href="#orge1a9be4">字符串</a></li>
</ul>
</div>
</div>
<p>
以前只介绍了 <span class="underline">表</span> 和 <span class="underline">数</span> ，因为它们在 Scheme 中最为常用。然而，Scheme也有像 <b>字符</b> 、 <b>字符串</b> 、 <b>符号</b> 、 <b>向量</b> 等的其它数据类型
</p>
<div id="outline-container-orgdad31ce" class="outline-2">
<h2 id="orgdad31ce">字符</h2>
<div class="outline-text-2" id="text-orgdad31ce">
<p>
在某个字符前添加 <span class="underline">#\</span> 来表明它是一个 <b>字符</b> 
</p>

<pre class="example">
例如：

#\a 表示字符 a
#\Space 表示 空格
#\Tab 表示 制表符
#\Linefeed 表示 Linefeed
#\Return 表示回车
</pre>

<p>
R5RS 中定义了下面的与字符相关的函数：
</p>

<ul class="org-ul">
<li>(char? obj) ：如果 <span class="underline">obj</span> 是一个 <b>字符</b> 则返回 <span class="underline">#t</span></li>
<li>(char=? c1 c3) :  如果 <span class="underline">c1</span> 和 <span class="underline">c2</span> 是 <b>同一个字符</b> 的话则返回 <span class="underline">#t</span></li>
<li>(char-&gt;integer c) : 将 <span class="underline">c</span> 转化为对应的 <span class="underline">整数</span> (character code)</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>char-&gt;integer #\a<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;  </span><span style="color: #5f9ea0; font-style: italic;">97</span>
</pre>
</div>

<ul class="org-ul">
<li>(integer-&gt;char n) : 将一个 <span class="underline">整数</span> 转化为对应的 <span class="underline">字符</span></li>
<li>比较字符：
<ul class="org-ul">
<li>(char&lt;? c1 c2)</li>
<li>(char&lt;= c1 c2)</li>
<li>(char&gt; c1 c2)</li>
<li>(char&gt;= c1 c2)</li>
</ul></li>
</ul>

<pre class="example">
    实际上是比较的 字符代码的大小

    例如，(char&lt;? c1 c2)等同于(&lt; (char-&gt;integer c1) (char-&gt;integer c2))
</pre>
<ul class="org-ul">
<li>(char-ci=? c1 c2)</li>
<li>(char-ci&lt;? c1 c2)</li>
<li>(char-ci&lt;=? c1 c2)</li>
<li>(char-ci&gt;? c1 c2)</li>
<li>(char-ci&gt;=? c1 c2)</li>
</ul>

<pre class="example">
    这些比较函数对大小写不敏感
</pre>
<ul class="org-ul">
<li>这些函数分别用于检测字符 <span class="underline">c</span> 是否为 <span class="underline">字母</span> 、 <span class="underline">数字</span> 、 <span class="underline">空白符</span> 、 <span class="underline">大写字母</span> 或 <span class="underline">小写字母</span> 
<ul class="org-ul">
<li>(char-alphabetic? c)</li>
<li>(char-numeric? c)</li>
<li>(char-whitespace? c)</li>
<li>(char-upper-case? c)</li>
<li>(char-lower-case? c)</li>
</ul></li>
<li>这些函数分别返回字符 <span class="underline">c</span> 对应的 <span class="underline">大写</span> 或 <span class="underline">小写</span> 
<ul class="org-ul">
<li>(char-upcase c)</li>
<li>(char-downcase c)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge1a9be4" class="outline-2">
<h2 id="orge1a9be4">字符串</h2>
<div class="outline-text-2" id="text-orge1a9be4">
<p>
<b>字符串</b> 通过两个 <span class="underline">闭合的双引号</span> 表示：
</p>
<pre class="example">
    例如，"abc" 表示字符串 abc
</pre>

<p>
R5RS 定义了下面的函数：
</p>
<ul class="org-ul">
<li>(string? s)：如果 <span class="underline">s</span> 是一个 <b>字符串</b> 则返回 <span class="underline">#t</span></li>
<li>(make-string n c) :  返回由 <span class="underline">n个</span> 字符 <span class="underline">c</span> 组成的 <span class="underline">字符串</span> 。参数 <span class="underline">c</span> <b>可选</b></li>
<li>(string-length s) :  返回字符串 <span class="underline">s</span> 的 <b>长度</b></li>
<li>(string=? s1 s2) : 如果字符串 <span class="underline">s1</span> 和 <span class="underline">s2</span>  <b>相同</b> 的话则返回 <span class="underline">#t</span></li>
<li>(string-ref s idx) :  返回字符串 <span class="underline">s</span> 中 <b>索引</b> 为 <span class="underline">idx</span> 的字符（索引从 0 开始计数）</li>
<li>(string-set! s idx c) : 将字符串 <span class="underline">s</span> 中 <span class="underline">索引</span> 为 <span class="underline">idx</span> 的字符 <b>设置</b> 为 <span class="underline">c</span></li>
<li>(substring s start end) : 返回字符串 <span class="underline">s</span> 从 <span class="underline">start</span> 开始到 <span class="underline">end - 1</span> 处的 <b>子字符串</b></li>
</ul>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>substring <span style="color: #deb887;">"abcdefg"</span> 1 4<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;  </span><span style="color: #5f9ea0; font-style: italic;">"bcd"</span>
</pre>
</div>
<ul class="org-ul">
<li>(string-append s1 s2 &#x2026;) : <b>连接</b> 两个字符串 <span class="underline">s1</span> 和 <span class="underline">s2</span></li>
<li>(string-&gt;list s) :  将字符串 <span class="underline">s</span> 转换为由 <b>字符构成的表</b></li>
<li>(list-&gt;string ls) : 将一个由 <span class="underline">字符构成的表</span> 转换为 <span class="underline">字符串</span></li>
<li>(string-copy s) : <b>复制</b> 字符串 <span class="underline">s</span></li>
</ul>

<p>
<a href="symbol.html">Next：符号</a>
</p>

<p>
<a href="assign.html">Previous：赋值</a>
</p>

<p>
<a href="slt.html">Home：目录</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
